
                                       #როგორ მუშაობს CPU
#CPU არის კომპიუტერის ერთ-ერთი მთავარი ნაწილი რომელიც ასრულებს ყველაზე მთავარ ოპერაციებს (რეგისტრებს)
#  ფაქტიურად ის არის კომპიუტერის ტვინი.


#CPU  კომპიუტერის მთავარი კომპონენტია, რომელიც პასუხისმგებელია
#  მონაცემების პროცესზე და ანგარიშების შესრულებაზე. მისი მუშაობის ძირითადი სტრუქტურები და პროცესები შემდეგნაირად ხდება:


# CPU უზრუნველყოფს ბრძანებების შესრულებას და შესრულების მართვას.
# CPU-ს ძირითადი ნაწილებია:
#არითმეტიკული და ლოგიკური ერთეული : Performs arithmetic operations (addition, subtraction) and logical operations (AND, OR).
#კონტროლის ერთეული : მართავს CPU-ს შიდა პროცესებს და უზრუნველყოფს ბრძანებების სწორად შესრულებას.
# სწრაფი მეხსიერების ადგილები, სადაც CPU-ს დროებით მონაცემები ინახება.
 



                                         #როგორ მუშაობს RAM

#RAM (Random Access Memory) არის კომპიუტერის მეხსიერების ტიპი, რომელიც ამჟამად მუშა პროცესებს ინახავს. 
#1. ზოგადი ინფორმაცია
#ქმედება: RAM არის მეხსიერება, რომელიც შეიძლება სწრაფად წაიკითხოს და ჩაიწეროს. ის იყიდება დროებითი მეხსიერებისათვის,
#  რაც ნიშნავს, რომ მონაცემები გრძელდება მხოლოდ მაშინ, როდესაც კომპიუტერი ჩართულია.
#მოცულობა: RAM-ის მოცულობა განსაზღვრავს, რამდენი მონაცემი და პროგრამა შეიძლება  შეინარჩუნოს.
    #2. როგორ მუშაობს RAM
##მანიპულაციის ტიპები: RAM იყოფა ორი ძირითად ტიპად:
#RAM  საჭიროებს პერიოდულ ახლებურ შევსებას, რადგან მისი მონაცემები ხანმოკლე ვადით იკარგება.
#RAM : მონაცემები ინახება უჯრედებში, რაც არ საჭიროებს მუდმივ შევსებას, მაგრამ უფრო ძვირია და ნაკლებად გამოიყენება დიდ მოცულობებში.

                

                                         #როგორ მუშაობს     GPU 
   
#GPU  არის სპეციალიზებული პროცესორი, რომელიც გამოიყენება ვიზუალური მონაცემების პროცესისთვის
# განსაკუთრებით გრაფიკის rendering-ისთვის. მისი მუშაობა განსხვავდება CPU-ისგან,
#  რადგან GPU-ის ძირითადი მიზანია პარალელური პროცესების შესრულება. 
   #1. არქიტექტურა
# GPU-ები მრავალმხრივი პროცესორებით არიან გაწვდილი, რაც მათ საშუალებას აძლევს რამდენიმე მონაცემზე ერთდროულად იმუშაონ.
#  ეს მათ ძალიან ეფექტურებს ხდის ვიზუალური ეფექტების შექმნაში
#GPU-ები შედგება ათასობით მცირე გრაფიკული ერთეულისგან, რომლებიც დამოუკიდებლად მუშაობენ და ქმნიან უფრო კომპლექსურ გამოსახულებებს.

