 #მომხარებელს შემოატანინეთ რიცხვი და გაიგეთ არის თუ არა ის მარტივი, თუ მარტივია დაპრინტეთ "Number is prime",
 #  სხვა შემთხვევაში "Number is not prime"(მარტივია რიცხვი, რომელიც იყოფა მარტო თავის თავზე და ერთზე)

num=int(input("enter number: ")) #მომხმარებელმა უნდა შეიყვანოს რიცხვი 
if num > 1:          #აქ ვამბობთ რომ თუ რიცხვი 1 ზე მეტია
    for i in range(2, (num//2)+1): #ვატარებთ ციკლას 2 დან numis ნახევრამდე 
        if num % i == 0:   #თუ num გაყოფილი i-ზე ტოლია 0-ის 
            print(num, "is not a prime number") # ვბეჭდავთ რიცხვი არ არის მარტივი 
            break      # ვამთავრებთ ციხკლას 
    else:            #სხვა შემთხვევაში 
        print(num, "is a prime number") #ვბეჭდავთ რიცხვი არის მარტივი 


