num1=int(input("enter number: ")) #შევქმენით ცვლადი სადაც მომხმარებელი შემოიტანს რიცხვს 
num2=int(input("enter number: ")) #შევქმენით  მეორე ცვლადი სადა მომხმარებელი შემოიტანს მეორე რიცხვს      
sum=num1**3+num2**3    #აქ შევქმენით ცვლადი სადაც ვინახავთ შემოტანილი რიცხვების კუბების ჯამს
if sum %2==0:     # აქ შემოგვაქვს if ფუნქცია და ვამბობთ რომ თუ sum იყოფა 2 და ნაშთია 0 მაშინ 
    print("Result is Even")  # დაბეჭდე რომ ის არის ლუწი 
else:
    print("Result is Odd")  # აქ ვამბობთ რომ სხვა შემთხვევაში  დაბეჭდე რომ ის არის კენტი 









