
const users = [
    {name:"luka", surname:"dgebuadze", age:"16"},
    {name:"nika", surname:"maisuradze", age:"18"},
    {name:"luksona", surname:"jafaridze", age:"20"}
]

const user = {
    name:"saba",
    surname:"tabatadze",
    age:"19"
}
console.table(users)
console.table(user)
// მოდული: ეს არის კოდი რომელსაც აქვს თავისი 
// ფუნქციონალი და სხვა კოდთან შეიძლება ურთიერთობა ექსპორტით ან იმპორტით.


// მოდულარობა:არის  დამოუკიდებელ მოდულებად დაყოფა, რათა კოდი გახდეს უფრო ორგანიზებული


// ჩაშენებული მოდულები: ეს არის მოდულები რომლებიც უკვე მოყვება პლატფორმას 


// გარე მოდულები: ეს არის ისეთი მოდულები რომლებიც გარე წყაროდან უნდა დაინსტალირდეს


// გლობალური მოდულები: ეს არის მოდულები რომლებიც ხელმისაწვდომია ყველგან ჩვენს კოდში მაგალითად console-ში და აშშ


// გამშვები გარემო — ეს არის  სისტემა რომელიც კითხულობს და ასრულებს ჩენს კოდს