// გვიჩენებს ოპერატიული სისტემის ტიპს 
const os = require('os');
console.log(os.type())

// აჩვენებს კომპიუტერის პროცესორის არქიტექტურას. (bit)
console.log(os.arch())

// გაჩვენებს კომპიუტერის ქსელურ ინტერფეისებს
console.log(os.networkInterfaces())

// ეს გვიჩვენებს მომხმარებლის მთავარი დირექტორიის (home directory) მისამართს.
console.log(os.homedir())


//გვიჩვენებს კომპიუტერის ჰოსტის სახელს  ანუ იმ სახელს, რომლითაც თქვენი კომპიუტერი ცნობილია ქსელში.
console.log(os.hostname())

// გვიჩვენებს სისოტემის მუშაობის ანუ ჩართულობის დროს წამებში 
console.log( os.uptime())