// Server —  არის პროგრამა რომელიც ელოდება მოთხოვნებს  მომხმარებლებისგან და აგზავნის პასუხს.
// request — ეს არის მომხმარებლის მიერ გაგზავნილი მოთხოვნა სერვერისადმი.
// response — ეს არის სერვერის პასუხი მომხმარებლის მოთხოვნაზე.
// http module — ეს მოდული გვაძლევს შესაძლებლობას შევქმნათ სერვერი Node.js-ში.
// მას ვიყენებთ იმისთვის რომ ვუზრუნველყოთ მომხმარებელსა და სერვერს შორის კომუნიკაცია ინტერნეტის მეშვეობით .
// res.end() ნიშნავს, რომ სერვერმა დაასრულა პასუხის გაგზავნა და კლიენტთან კავშირი იხურება.