                             #როგორ მუშაობს ინტერნეტი და როგორ უკავშირდება ერთი კომპიუტერი მეორეს?

#ინტერნეტი არის გლობალური ქსელი, რომელიც უკავშირდება სხვადასხვა კომპიუტერებს და მოწყობილობებს. 
#ინტერნეტი დამზადებულია უამრავი კავშირისგან, რაც სხვადასხვა ტიპის მოწყობილობებს (კომპიუტერები, სმარტფონები, სერვერები)
#  საშუალებას აძლევს კომუნიკაციისთვის.
   
    #თითოეულ მოწყობილობას ინტერნეტში აქვს უნიკალური IP  მისამართი. ეს მისამართი მოქმედებს როგორც „ფოსტა“,
#  რომლის მეშვეობითაც მონაცემები აიტვირთება და გაიგზავნება.

   # ინტერნეტში კომუნიკაციისთვის გამოიყენება სხვადასხვა პროტოკოლები, რომელთა შორის ყველაზე პოპულარულია 
# TCP/IP . TCP უზრუნველყოფს მონაცემების გამართულ გადაცემას, ხოლო IP აგზავნის მათ.

   #როდესაც ჩვენ ავკრიფავთ ვებსაიტის სახელს 
# DNS გარდაქმნის მას შესაბამის IP მისამართში, რაც საშუალებას გვაძლევს ჩვენ კომპიუტერი დავაკავშიროთ სასურველ სერვერთან.
 
   #მონაცემები ინახება პაკეტების სახით და გადის სხვადასხვა რუტერებზე, სანამ მიაღწევს საბოლოო დანიშნულებას. 
# რუტერები განსაზღვრავენ საუკეთესო მარშუტებს მონაცემების გადასაცემად.

   #ინტერნეტში მოწყობილობები შეიძლება იყოს სერვერები (რომლებიც ფლობენ და ამჟღავნებენ მონაცემებს)
#  და კლიენტები (რომლებიც ითხოვენ და იღებენ ამ მონაცემებს). როდესაც თქვენ ვებსაიტზე შედიხართ, თქვენი ბრაუზერი კლიენტია, ხოლო ვებსაიტი — სერვერი.