#შექმენით ორი ცვლადი, პირველში შეინახეთ 1-დან 20-ის ჩათვლით ყველა ლუწი რიცხვის ჯამი, მეორეში კი ყველა კენტის.
#  აიყვანეთ ორივე მე-5 ხარისხში და დაპრინტეთ ის, რომელიც არის მეტი
even_sum=0    #შევქმენით ცვლადი საყისი მნიშვნელობით 
odd_sum=0     # შევქმენით მეორე ცვლადი საწყისი მნიშვნელობით 
for i in range(1,21): #სულ 1 დან ოცის ჩათვლით 
    if i%2==0:     #თუ i იყოფა 2-ზე უნაშთოდ 
        even_sum=even_sum+i   #even_sum-ს ვუმატებთ i-ს რიცხვს 
    elif i%2 !=0:      #თუ i არ იყოფა 2-ზე უნაშთოდ 
        odd_sum=odd_sum+i # odd_sum ვუმატებთ i რიცხვს 
num1=even_sum**5 # even_sum აგვყავს მეხუთე ხარისხში და ვინახავთ num1 ცვლადში 
num2=odd_sum**5  # odd_ sum აგვყავს მეხუთე ხარისხში და ვინახავთ num2 ცვლადში  
if num1>num2:  #თუ num1>num2 ზე 
 print(num1)   #ვბეჭდავთ num1-ს 
elif num1<num2:  #სხვა თუ num1<num2 ზე 
      print(num2) #ვბეჭდავთ num2-ს 






