
# შექმენით რიცხვების დიაპაზონი 1-დან 100-მდე, შეამოწმეთ თუ რიცხვი იყოფა 3-ზე დაბეჭდეთ "Fizz" 
# და გვერდზე მიუწერეთ რიცხვი. თუ რიცხვი იყოფა 5-ზე დაბეჭდეთ "Buzz" და გვერდზე მიუწერეთ რიცხვი,
#  ხოლო თუ იყოფა 3-ზეც და 5-ზეც დაბეჭდეთ "FizzBuzz" და გვერდზე მიუწერეთ რიცხვი

for i in range(1,100):   # სვლა არის 1 დან ასამდე 
    if i%3==0 and i%5==0:   #თუ iიყოფა სამზეც და 5 ზეც უნაშთოდ 
        print("fizzbuzz"+str(i)) # ვბეჭდავთ fizzbuzz-ს და რიცხვს 
    elif i%3==0:                 #თუ i იყოფა 3 ზე უნაშთოდ 
        print("fizz"+str(i))     #ვბეჭდავთ fizz-ს და რიცხვს 
    elif i%5==0:                 #თუ i იყოფა 5 ზე უნაშტოდ 
        print("buzz"+str(i))     #ვბეჭდავთ buzz-ს და რიცხვს 